Revit 2024 API
AnalyticalEquipmentLoadData.ApparentLoad Property
 The electrical apparent load of analytical equipment load.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2023
Syntax
C#
public double ApparentLoad { get; set; }
Visual Basic
Public Property ApparentLoad As Double
	Get
	Set
Visual C++
public:
property double ApparentLoad {
	double get ();
	void set (double value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  When setting this property: The given value for value is not a number -or- When setting this property: The given value for value is not finite
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  When setting this property: The given value for value must be non-negative.
See Also
AnalyticalEquipmentLoadData Class
Autodesk.Revit.DB.Electrical Namespace